Тест1/src/Catalogs/МодельТС/МодельТС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МодельТС</name>
  <owners>Catalog.ТипТС</owners>
  <tabularSections>
    <name>ПлановыеРемонты</name>
    <attributes>
      <name>ВидОбслуживания</name>
      <type>
        <types>CatalogRef.ВидыОбслуживания</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПланированияПоВыработке</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Периодичность</name>
      <type>
        <types>EnumRef.Периодичность</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрВыработки</name>
      <type>
        <types>EnumRef.ПараметрыВыработкиАтомобиля</types>
      </type>
    </attributes>
    <attributes>
      <name>Допуск</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПовторов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Тест1/src/Catalogs/МодельТС/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ПлановыеРемонты Цикл
	
		Если НЕ СтрокаТаблицы.ВидПланированияПоВыработке 
			И Не ЗначениеЗаполнено(СтрокаТаблицы.Периодичность) Тогда
			
			Путь = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПлановыеРемонты", СтрокаТаблицы.НомерСтроки, "Периодичность");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Не заполнена колонка Периодичность в строке %1 списка ""Плановые ремонты""",
					СтрокаТаблицы.НомерСтроки),
				,
				Путь,
				"Объект",
				Отказ
			);
				
			
		КонецЕсли;
	
	КонецЦикла;
	
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли
